--insert into ord values
--(4021, 1001, 2001, 3001, 9, '2025-09-10'),
--(4022, 1001, 2002, 3001, 1, '2025-09-14'),
--(4023, 1001, 2006, 3002, 9, '2025-09-15'),
--(4024, 1001, 2003, 3003, 2, '2025-09-12'),
--(4025, 1001, 2001, 3004, 5, '2025-09-13'),
--(4026, 1002, 2001, 3005, 7, '2025-09-30'),
--(4027, 1002, 2002, 3001, 1, '2025-09-11'),
--(4028, 1003, 2001, 3002, 2, '2025-09-21'),
--(4029, 1003, 2006, 3003, 8, '2025-09-21'),
--(4030, 1003, 2007, 3004, 1, '2025-09-21'),
--(4031, 1003, 2007, 3003, 6, '2025-09-12'),
--(4032, 1004, 2007, 3001, 6, '2025-09-20'),
--(4033, 1004, 2001, 3004, 4, '2025-09-14'),
--(4034, 1004, 2001, 3004, 4, '2025-09-16'),
--(4035, 1004, 2001, 3003, 1, '2025-09-22'),
--(4036, 1004, 2004, 3005, 3, '2025-09-16'),
--(4037, 1004, 2007, 3002, 7, '2025-09-19'),
--(4038, 1005, 2001, 3005, 5, '2025-09-17'),
--(4039, 1006, 2004, 3005, 2, '2025-09-18'),
--(4040, 1006, 2003, 3002, 38, '2025-09-01');

--1 Вывести количество продавцов из городов, начинающихся на буквы I-N.
select count(name) from sal where city ~ '^[I-N].*';
--2 Вывести наименьший и наибольший вес из таблицы продуктов.
select min(weight), max(weight) from prod;
--3 Вывести для каждого продукта наименьший номер продавца, у которого этот
--продукт продавался.
select pnum, min(snum) from ord group by pnum order by pnum;
--4 Вывести число уникальных продавцов, которые продавали товары покупателям
--с номерами 2005 и 2004
select count(distinct(snum)) from ord where cnum in (2004,2005);
--5 Вывести для каждого покупателя его номер и общее количество проданных
--продуктов, если это количество не меньше, чем 15
select cnum, sum(amt) from ord group by cnum having sum(amt)>=15 order by cnum;
--6 Вывести количество заказов для всех уникальных пар продавец-продукт,
--между которыми осуществлялись заказы.
select snum, pnum, count(*) from ord group by snum, pnum order by snum, pnum;
--7 Вывести все даты, в которые в заказах участвовали ровно 3 покупателя
--и 1 продукт.
select ord_date, count(distinct(cnum)), count(distinct(pnum))
from ord group by ord_date
having count(distinct(cnum)) = 3 and count(distinct(pnum)) = 1